In [87]:
import pandas as pd 
import numpy as np

In [88]:
s = pd.Series([10,34,56,44,24])
print(s)

0    10
1    34
2    56
3    44
4    24
dtype: int64

In [89]:
s.name = "calories"

In [90]:
s.values

array([10, 34, 56, 44, 24], dtype=int64)

In [91]:
s.index

RangeIndex(start=0, stop=5, step=1)

In [92]:
#indexing
s[2:4]

2    56
3    44
Name: calories, dtype: int64

In [93]:
#iloc = loction based indexing
s.iloc[3]

44

In [94]:
s.iloc[[1,3,4]]

1    34
3    44
4    24
Name: calories, dtype: int64

In [95]:
a = pd.Series([10,34,56,44,24])
a.index = ["apple","banana","goa","oranges","strawberry"]
print(a)

apple         10
banana        34
goa           56
oranges       44
strawberry    24
dtype: int64

In [96]:
#loc = this is label based indexing
a.loc[["apple","banana","goa"]]

apple     10
banana    34
goa       56
dtype: int64

In [97]:
#conditional selection
a[a>10]

banana        34
goa           56
oranges       44
strawberry    24
dtype: int64

In [98]:
#logical operators
#and
a[(a>10) & (a<=40)]

banana        34
strawberry    24
dtype: int64

In [99]:
#not
a[~(a>10)]

apple    10
dtype: int64

In [100]:
#modification
a['apple'] = 60
print(a)

apple         60
banana        34
goa           56
oranges       44
strawberry    24
dtype: int64

In [101]:
b = pd.Series(['a',np.nan,1,np.nan])
b.notnull().sum()

2

In [103]:
#DataFrame
data = {

"Name": ["Alice", "Bob", "Charlie", "David", "Eve", "Alice"],

"Age": [25, 30, 35, np.nan , 29, 25],

"Department": ["HR", "IT", "Finance", "IT", "HR", "HR"],

"Salary" : [50000, 60000, 70000, 62000, np.nan, 50000]

}

In [104]:
df = pd.DataFrame(data)
print(df)

      Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0
4      Eve  29.0         HR      NaN
5    Alice  25.0         HR  50000.0

In [74]:
#iloc and loc
df.iloc[2:3,1:2]#row and column

   Age
2   35

In [75]:
df.loc[2:3,['Age','Department']]

   Age Department
2   35    Finance
3   60         IT

In [76]:
df.drop("Age",axis =1,inplace = True)
print(df)

      Name Department  Salary
0    Alice         HR   50000
1      Bob         IT   60000
2  Charlie    Finance   70000
3    David         IT   62000
4      Eve         HR   50000
5    Alice         HR   50000

In [79]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        6 non-null      object
 1   Age         6 non-null      int64
 2   Department  6 non-null      object
 3   Salary      6 non-null      int64
dtypes: int64(2), object(2)
memory usage: 324.0+ bytes

In [80]:
df.describe()

             Age        Salary
count   6.000000      6.000000
mean   34.000000  57000.000000
std    13.266499   8366.600265
min    25.000000  50000.000000
25%    26.000000  50000.000000
50%    29.500000  55000.000000
75%    33.750000  61500.000000
max    60.000000  70000.000000

In [83]:
#boardcasting
df["Salary"] = df["Salary"]+5000
print(df["Salary"])

0    60000
1    70000
2    80000
3    72000
4    60000
5    60000
Name: Salary, dtype: int64

In [84]:
df["Salary"].unique()

array([60000, 70000, 80000, 72000], dtype=int64)

In [85]:
df["Department"].value_counts()

Department
HR         3
IT         2
Finance    1
Name: count, dtype: int64

In [105]:
df.isnull().sum()

Name          0
Age           1
Department    0
Salary        1
dtype: int64

In [ ]:
df.dropna(how = "any")#any null values in the row
df.dropna(how = "all")#all the null values of the row

In [106]:
#fill the missing values
df.fillna(0)

      Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   0.0         IT  62000.0
4      Eve  29.0         HR      0.0
5    Alice  25.0         HR  50000.0

In [107]:
#handle missing value with mean median
df["Age"].fillna(df["Age"].mean())

0    25.0
1    30.0
2    35.0
3    28.8
4    29.0
5    25.0
Name: Age, dtype: float64

In [108]:
df["Salary"].fillna(df["Salary"].median())

0    50000.0
1    60000.0
2    70000.0
3    62000.0
4    60000.0
5    50000.0
Name: Salary, dtype: float64

In [109]:
 df["Salary"].fillna(method = "ffill")

C:\Users\krishna chaitrika\AppData\Local\Temp\ipykernel_1948\2174500761.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["Salary"].fillna(method = "ffill")

0    50000.0
1    60000.0
2    70000.0
3    62000.0
4    62000.0
5    50000.0
Name: Salary, dtype: float64

In [112]:
#duplicate value
df_dul = df[df.duplicated(keep = "first")]
df_dul

    Name   Age Department   Salary
5  Alice  25.0         HR  50000.0

In [113]:
df = df.drop_duplicates()

In [114]:
df

      Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0
4      Eve  29.0         HR      NaN

In [115]:
#apply and func
def multiply(x):
    return x*2

df["Age"] = df["Age"].apply(multiply)

In [116]:
df["Age"]

0    50.0
1    60.0
2    70.0
3     NaN
4    58.0
Name: Age, dtype: float64

In [118]:
#apply lambda
df["Age"] = df["Age"].apply(lambda x:x/2)
df["Age"]

0    12.5
1    15.0
2    17.5
3     NaN
4    14.5
Name: Age, dtype: float64